{
    "nav-about": "Acerca de",
    "nav-skills": "Habilidades",
    "nav-projects": "Proyectos",
    "nav-contact": "Contacto",
    "hero-name": "Rubén Roldán",
    "hero-title": "Especialista en Soporte Técnico y Desarrollador",
    "hero-subtitle": "20+ años apoyando soluciones empresariales, transicionando hacia desarrollo innovador",
    "hero-cta": "Contáctame",
    "about-title": "Acerca de Mí",
    "about-text1": "Especialista en Soporte Técnico y Desarrollador Emergente con 20+ años apoyando soluciones de software empresarial en 20+ países en sectores bancarios, telecomunicaciones y gubernamentales.",
    "about-text2": "Experimentado en JavaScript, React, Node.js, Python, SQL, HTML/CSS con experiencia práctica en soporte de aplicaciones. Especializado en resolución de problemas de bases de datos, integración de sistemas y resolución técnica.",
    "about-text3": "Transicionando experiencia en soporte técnico hacia soluciones de desarrollo para impulsar innovación y eficiencia.",
    "skills-title": "Habilidades Técnicas",
    "skills-support": "Soporte Técnico",
    "skills-support-desc": "Soporte y resolución de problemas de aplicaciones empresariales en múltiples plataformas y tecnologías.",
    "skills-web": "Desarrollo Web",
    "skills-web-desc": "Tecnologías web modernas y frameworks para crear aplicaciones responsivas.",
    "skills-database": "Gestión de Bases de Datos",
    "skills-database-desc": "Experiencia en gestión de bases de datos SQL e integración de sistemas.",
    "skills-programming": "Programación",
    "skills-programming-desc": "Múltiples lenguajes de programación y metodologías de desarrollo.",
    "projects-title": "Proyectos y Experiencia",
    "project1-title": "Soporte Soluciones Bancarias",
    "project1-desc": "Proporcioné soporte técnico para el sistema de gestión de ventas de agentes bancarios Coretrac en múltiples países, asegurando 100% de tiempo de actividad y satisfacción del cliente.",
    "project2-title": "Proyectos de Desarrollo Web",
    "project2-desc": "Desarrollé aplicaciones web responsivas usando tecnologías modernas incluyendo React, Node.js, y varios frameworks CSS para diversos requisitos de clientes.",
    "project3-title": "Gestión de Infraestructura",
    "project3-desc": "Gestioné infraestructura IT para 800+ empleados en 5 oficinas, incluyendo mantenimiento de servidores, configuración de red y actualizaciones de sistema.",
    "contact-title": "Ponte en Contacto",
    "contact-subtitle": "Listo para colaborar en tu próximo proyecto o discutir oportunidades",
    "contact-email": "Email",
    "contact-location": "Ubicación",
    "contact-availability": "Disponibilidad",
    "contact-available": "Disponible para colaboraciones de proyectos y oportunidades laborales",
    "contact-social": "Conéctate Conmigo",
    "footer-text": "© 2025 Portfolio. Todos los derechos reservados."
}